{
  "value": {
    "recommendations": [
      {
        "movie": "Based on your taste profile from Inception, Interstellar, Never Let Me Go, and Eternal Sunshine of the Spotless Mind",
        "books": [
          {
            "title": "The Wind-Up Bird Chronicle",
            "author": "Haruki Murakami",
            "reason": "This novel epitomizes the blend of reality and surrealism, much like 'Inception' and 'Eternal Sunshine of the Spotless Mind'. Murakami intricately weaves a narrative that explores themes of memory, identity, and the subconscious, echoing the existential concerns found in 'Never Let Me Go'. The protagonist's journey through a bizarre world mirrors the complex emotional landscapes of your preferred films, with deep character introspection and philosophical musings that resonate with your taste for layered narratives.",
            "rating": 4.024945770065075,
            "cover_url": "https://assets.hardcover.app/editions/30387653/7f3a72c2-328a-494c-bfea-0c884f8fcf47.jpg",
            "hardcover_url": null,
            "taste_match_score": 0.95,
            "primary_appeal": "Philosophical exploration of identity and memory",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1994,
            "page_count": 607,
            "publisher": null,
            "hardcover_id": "469816",
            "users_count": 1169,
            "description": "apan's most highly regarded novelist now vaults into the first ranks of international fiction writers with this heroically imaginative novel, which is at once a detective story, an account of a disintegrating marriage, and an excavation of the buried secrets of World War II.\n\nIn a Tokyo suburb a young man named Toru Okada searches for his wife's missing cat. Soon he finds himself looking for his wife as well in a netherworld that lies beneath the placid surface of Tokyo. As these searches intersect, Okada encounters a bizarre group of allies and antagonists: a psychic prostitute; a malevolent yet mediagenic politician; a cheerfully morbid sixteen-year-old-girl; and an aging war veteran who has been permanently changed by the hideous things he witnessed during Japan's forgotten campaign in Manchuria.\n\nGripping, prophetic, suffused with comedy and menace, The Wind-Up Bird Chronicle is a tour de force equal in scope to the masterpieces of Mishima and Pynchon."
          },
          {
            "title": "Cloud Atlas",
            "author": "David Mitchell",
            "reason": "Mitchell's 'Cloud Atlas' captures the essence of narrative complexity, interweaving multiple stories across different timelines that reflect the interconnectedness of human experience. The themes of reincarnation and the impact of choices resonate with the philosophical undertones present in 'Interstellar' and 'Never Let Me Go'. The emotional depth found in each character's journey aligns with your preference for rich character development, while the genre-blending nature of the book reflects the artistic sensibilities you enjoy in films.",
            "rating": 3.932572614107884,
            "cover_url": "https://assets.hardcover.app/book_mappings/7332476/6f64bd9cf3ea5cf6fd5ab88786fd2b0955e17d67.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.93,
            "primary_appeal": "Interconnected narratives exploring existential themes",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2003,
            "page_count": 509,
            "publisher": null,
            "hardcover_id": "332566",
            "users_count": 1371,
            "description": "Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . .\n\nAbruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history.\n\nBut the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky."
          },
          {
            "title": "The Bone Clocks",
            "author": "David Mitchell",
            "reason": "Similar to the narrative style of 'Inception', 'The Bone Clocks' features a complex structure that traverses time and reality, delving into the fluidity of existence and consciousness. The book's exploration of time, mortality, and the ethereal nature of life resonates deeply with the themes of identity and memory that you appreciate. The character arcs are profound, highlighting personal growth amidst fantastical elements, paralleling the emotional depth seen in your favorite films.",
            "rating": 5.0,
            "cover_url": "https://assets.hardcover.app/external_data/60386304/4dd270d982e7b01aa3ef4893a3531ebe6375e73b.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.92,
            "primary_appeal": "Exploration of time and consciousness through character development",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2014,
            "page_count": 24,
            "publisher": null,
            "hardcover_id": "1233437",
            "users_count": 4,
            "description": null
          },
          {
            "title": "Station Eleven",
            "author": "Emily St. John Mandel",
            "reason": "This novel combines elements of speculative fiction and character-driven narrative, much like 'Interstellar' and 'Never Let Me Go'. It examines the fragility of civilization and the importance of art and memory in the face of apocalypse. The emotional tone is reflective and haunting, mirroring the bittersweet sentiments in 'Eternal Sunshine of the Spotless Mind'. The richly drawn characters confront existential questions about survival and meaning, aligning perfectly with your preferences for deep emotional and thematic resonance.",
            "rating": 4.082437275985663,
            "cover_url": "https://assets.hardcover.app/external_data/47671286/cde65e40092722f63a5b9a29a672d12bc75ae19b.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.9,
            "primary_appeal": "Bittersweet exploration of humanity and memory in a post-apocalyptic setting",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2014,
            "page_count": 333,
            "publisher": null,
            "hardcover_id": "427463",
            "users_count": 2395,
            "description": "Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end.\n\nTwenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band’s existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed."
          },
          {
            "title": "A Visit from the Goon Squad",
            "author": "Jennifer Egan",
            "reason": "Egan's novel employs a non-linear narrative style that echoes the complex storytelling seen in your favorite films. It explores themes of memory, aging, and the passage of time through interconnected characters, reflecting the intricacies of human relationships similar to those in 'Never Let Me Go'. The emotional weight of regret and the yearning for connection resonates with your preference for deep, introspective narratives, offering a blend of humor and pathos that aligns with your artistic sensibilities.",
            "rating": 3.806338028169014,
            "cover_url": "https://assets.hardcover.app/edition/30400488/be5fd0661f044488345da40a2c70a7e4aea41fe8.jpeg",
            "hardcover_url": "https://hardcover.app/books/a-visit-from-the-goon-squad",
            "taste_match_score": 0.88,
            "primary_appeal": "Non-linear narrative exploring memory and human connections",
            "genre_tags": [
              "Fiction",
              "Literature",
              "Friendship",
              "Anthologies & Short Stories",
              "Literary Fiction",
              "Genre Fiction",
              "Psychological",
              "Anthologies"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2010,
            "page_count": 289,
            "publisher": null,
            "hardcover_id": "10099",
            "users_count": 650,
            "description": "Jennifer Egan's spellbinding interlocking narratives circle the lives of Bennie Salazar, an aging former punk rocker and record executive, and Sasha, the passionate, troubled young woman he employs. Although Bennie and Sasha never discover each other's pasts, the reader does, in intimate detail, along with the secret lives of a host of other characters whose paths intersect with theirs, over many years, in locales as varied as New York, San Francisco, Naples, and Africa.\r\n\r\nWe first meet Sasha in her mid-thirties, on her therapist's couch in New York City, confronting her long-standing compulsion to steal. Later, we learn the genesis of her turmoil when we see her as the child of a violent marriage, then as a runaway living in Naples, then as a college student trying to avert the suicidal impulses of her best friend. We plunge into the hidden yearnings and disappointments of her uncle, an art historian stuck in a dead marriage, who travels to Naples to extract Sasha from the city's demimonde and experiences an epiphany of his own while staring at a sculpture of Orpheus and Eurydice in the Museo Nazionale. \r\n\r\nWe meet Bennie Salazar at the melancholy nadir of his adult life--divorced, struggling to connect with his nine-year-old son, listening to a washed-up band in the basement of a suburban house--and then revisit him in 1979, at the height of his youth, shy and tender, reveling in San Francisco's punk scene as he discovers his ardor for rock and roll and his gift for spotting talent. We learn what became of his high school gang--who thrived and who faltered--and we encounter Lou Kline, Bennie's catastrophically careless mentor, along with the lovers and children left behind in the wake of Lou's far-flung sexual conquests and meteoric rise and fall.\r\n\r\n*A Visit from the Goon Squad* is a book about the interplay of time and music, about survival, about the stirrings and transformations set inexorably in motion by even the most passing conjunction of our fates. In a breathtaking array of styles and tones ranging from tragedy to satire to PowerPoint, Egan captures the undertow of self-destruction that we all must either master or succumb to; the basic human hunger for redemption; and the universal tendency to reach for both--and escape the merciless progress of time--in the transporting realms of art and music. Sly, startling, exhilarating work from one of our boldest writers. *From the Hardcover edition.*"
          }
        ],
        "taste_profile": {
          "themes": [
            "existentialism",
            "memory and identity",
            "the impact of technology on humanity"
          ],
          "narrative_style": "Complex narratives that weave multiple timelines or perspectives, often requiring active engagement from the reader to piece together the story.",
          "emotional_tone": "A mix of poignant melancholy and hopeful introspection, exploring deep emotional connections and the fragility of relationships.",
          "genre_fusion": "A blend of science fiction with elements of psychological drama and romance, often incorporating speculative elements that challenge reality.",
          "character_preferences": "Deeply developed characters who grapple with philosophical dilemmas, personal loss, and ethical decisions, often leading to significant personal growth.",
          "artistic_sensibilities": "Visually rich and atmospheric storytelling that evokes a strong sense of place and mood, often with surreal or dreamlike qualities.",
          "confidence_score": 0.85
        },
        "recommendation_type": "unified"
      }
    ],
    "insights": {
      "total_movies_analyzed": 4,
      "dominant_themes": [
        "existentialism",
        "memory and identity",
        "the impact of technology on humanity"
      ],
      "genre_diversity_score": 0.8,
      "recommendation_confidence": 0.85,
      "alternative_suggestions": []
    },
    "processing_time": 14.859696626663208,
    "cache_hit": false
  },
  "created_at": "2025-07-20T01:55:45.568219",
  "expired_at": "2025-07-20T02:55:45.568201",
  "key": "movies_v2:85f2ea4599e54803dc33e98038eced12",
  "cache_type": "recommendations",
  "version": "2.0"
}