{
  "value": {
    "recommendations": [
      {
        "movie": "Based on your taste profile from Interstellar (2014), Eternal Sunshine of the Spotless Mind (2004), and Never Let Me Go (2010)",
        "books": [
          {
            "title": "Cloud Atlas",
            "author": "David Mitchell",
            "reason": "Cloud Atlas is a masterful narrative that intertwines multiple stories across different timelines, echoing the non-linear storytelling found in Interstellar and Eternal Sunshine of the Spotless Mind. Each character's journey reflects themes of memory and identity, much like the emotional arcs of the characters in your movie preferences. The book's exploration of how lives are interconnected and the consequences of our actions resonates with the existential themes of love and loss that you seem to appreciate. The atmospheric prose and philosophical undertones align perfectly with your artistic sensibilities, making it a compelling read.",
            "rating": 3.932572614107884,
            "cover_url": "https://assets.hardcover.app/book_mappings/7332476/6f64bd9cf3ea5cf6fd5ab88786fd2b0955e17d67.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.95,
            "primary_appeal": "Complex narrative structure and existential themes",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2003,
            "page_count": 509,
            "publisher": null,
            "hardcover_id": "332566",
            "users_count": 1371,
            "description": "Cloud Atlas begins in 1850 with Adam Ewing, an American notary voyaging from the Chatham Isles to his home in California. Along the way, Ewing is befriended by a physician, Dr. Goose, who begins to treat him for a rare species of brain parasite. . . .\n\nAbruptly, the action jumps to Belgium in 1931, where Robert Frobisher, a disinherited bisexual composer, contrives his way into the household of an infirm maestro who has a beguiling wife and a nubile daughter. . . . From there we jump to the West Coast in the 1970s and a troubled reporter named Luisa Rey, who stumbles upon a web of corporate greed and murder that threatens to claim her life. . . . And onward, with dazzling virtuosity, to an inglorious present-day England; to a Korean superstate of the near future where neocapitalism has run amok; and, finally, to a postapocalyptic Iron Age Hawaii in the last days of history.\n\nBut the story doesn’t end even there. The narrative then boomerangs back through centuries and space, returning by the same route, in reverse, to its starting point. Along the way, Mitchell reveals how his disparate characters connect, how their fates intertwine, and how their souls drift across time like clouds across the sky."
          },
          {
            "title": "The Bone Clocks",
            "author": "David Mitchell",
            "reason": "In The Bone Clocks, Mitchell once again weaves a narrative that spans different timelines and genres, similar to the narrative complexity of Interstellar. The interplay between reality and fantasy, alongside the protagonist's journey through love, loss, and the search for meaning, closely mirrors the character development and emotional depth found in your preferred films. The book’s exploration of mortality and the passage of time will resonate with your interests in existential themes, while its fast-paced structure keeps you engaged throughout.",
            "rating": 5.0,
            "cover_url": "https://assets.hardcover.app/external_data/60386304/4dd270d982e7b01aa3ef4893a3531ebe6375e73b.jpeg",
            "hardcover_url": "https://hardcover.app/books/the-bone-clocks-f9948688-dfc4-4967-b4b4-82cec660a3d8",
            "taste_match_score": 0.9,
            "primary_appeal": "Exploration of time and existential themes",
            "genre_tags": [],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2014,
            "page_count": 24,
            "publisher": null,
            "hardcover_id": "1233437",
            "users_count": 4,
            "description": null
          },
          {
            "title": "Annihilation",
            "author": "Jeff VanderMeer",
            "reason": "Annihilation dives into a mysterious and unsettling environment, much like the atmospheric and psychological tensions present in your movie preferences. The narrative structure is both compelling and ambiguous, prompting deep reflection on identity and transformation, which aligns with the themes of memory and self-discovery. The dark tone and fast pacing create an immersive experience, appealing to your preference for emotional depth and complexity. VanderMeer's vivid and surreal descriptions contribute to a rich visual aesthetic that matches your artistic sensibilities.",
            "rating": 3.718685831622177,
            "cover_url": "https://assets.hardcover.app/external_data/61104538/b91d0115043c247a33f6cea3d9aa571ff85721df.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.88,
            "primary_appeal": "Dark atmosphere and psychological depth",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2014,
            "page_count": 208,
            "publisher": null,
            "hardcover_id": "192491",
            "users_count": 2095,
            "description": "Area X has been cut off from the rest of the continent for decades. Nature has reclaimed the last vestiges of human civilization. The first expedition returned with reports of a pristine, Edenic landscape; the second expedition ended in mass suicide; the third expedition in a hail of gunfire as its members turned on one another. The members of the eleventh expedition returned as shadows of their former selves, and within weeks, all had died of cancer. In Annihilation, the first volume of Jeff VanderMeer's Southern Reach trilogy, we join the twelfth expedition.\n\nThe group is made up of four women: an anthropologist; a surveyor; a psychologist, the de facto leader; and our narrator, a biologist. Their mission is to map the terrain, record all observations of their surroundings and of one another, and, above all, avoid being contaminated by Area X itself.\n\nThey arrive expecting the unexpected, and Area X delivers—they discover a massive topographic anomaly and life forms that surpass understanding—but it's the surprises that came across the border with them and the secrets the expedition members are keeping from one another that change everything."
          },
          {
            "title": "Never Let Me Go",
            "author": "Kazuo Ishiguro",
            "reason": "Given that you already enjoy the film adaptation of Never Let Me Go, reading the book will deepen your understanding of the profound themes surrounding memory, identity, and the ethics of humanity. Ishiguro’s writing captures the essence of love and loss with a melancholic tone, mirroring the emotional landscapes in your favorite movies. The narrative’s reflective pace allows for deep character exploration, making it a perfect fit for your taste profile that values character development and existential pondering.",
            "rating": 3.828108672936259,
            "cover_url": "https://assets.hardcover.app/edition/30510372/5dea392164bc8a351c0606033069daba8e53db7c.jpeg",
            "hardcover_url": null,
            "taste_match_score": 0.92,
            "primary_appeal": "Themes of memory and human experience",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 2000,
            "page_count": 282,
            "publisher": null,
            "hardcover_id": "132314",
            "users_count": 2420,
            "description": "In one of the most memorable novels of recent years, Kazuo Ishiguro imagines the lives of a group of students growing up in a darkly skewered version of contemporary England. Narrated by Kathy, now 31, Never Let Me Go hauntingly dramatises her attempts to come to terms with her childhood at the seemingly idyllic Hailsham School, and with the fate that has always awaited her and her closest friends in the wider world. A story of love, friendship and memory, Never Let Me Go is charged throughout with a sense of the fragility of life.If you enjoyed Never Let Me Go, you might also like Ishiguro's The Remains of the Day, now available in Faber Modern Classics."
          },
          {
            "title": "The Road",
            "author": "Cormac McCarthy",
            "reason": "The Road offers a harrowing exploration of love and survival in a bleak, post-apocalyptic world, resonating with the dark thematic elements of your movie preferences. McCarthy's sparse yet powerful prose creates a haunting atmosphere that emphasizes the fragility of human connections, akin to the emotional depth seen in your selected films. The fast-paced narrative and the poignant relationship between the father and son provide a gripping reading experience, perfect for someone who appreciates complexity and emotional storytelling.",
            "rating": 4.024271844660194,
            "cover_url": "https://assets.hardcover.app/editions/642392/7620614454245640-cormacmcarthytheroad.jpg",
            "hardcover_url": null,
            "taste_match_score": 0.94,
            "primary_appeal": "Post-apocalyptic themes and emotional intensity",
            "genre_tags": null,
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1974,
            "page_count": 287,
            "publisher": null,
            "hardcover_id": "36087",
            "users_count": 2605,
            "description": "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other."
          }
        ],
        "taste_profile": {
          "themes": [
            "existentialism",
            "memory and identity",
            "love and loss"
          ],
          "narrative_style": "complex, non-linear storytelling with an emphasis on philosophical introspection and emotional resonance.",
          "emotional_tone": "dark and contemplative, often exploring the depths of human experience and the fragility of relationships.",
          "genre_fusion": "blends elements of science fiction, psychological drama, and speculative fiction, often steeped in futuristic or dystopian contexts.",
          "character_preferences": "deeply layered characters who grapple with existential dilemmas, showcasing vulnerability and emotional depth.",
          "artistic_sensibilities": "visually rich and atmospheric narratives that evoke a sense of wonder while simultaneously exploring darker themes.",
          "confidence_score": 0.85
        },
        "recommendation_type": "unified"
      }
    ],
    "insights": {
      "total_movies_analyzed": 3,
      "dominant_themes": [
        "existentialism",
        "memory and identity",
        "love and loss"
      ],
      "genre_diversity_score": 0.0,
      "recommendation_confidence": 0.85,
      "alternative_suggestions": []
    },
    "processing_time": 13.243268728256226,
    "cache_hit": false
  },
  "created_at": "2025-07-20T01:02:37.251736",
  "expired_at": "2025-07-20T02:02:37.251710",
  "key": "movies_v2:9cfedbf11ec87afe18013819e14f1fde",
  "cache_type": "recommendations",
  "version": "2.0"
}