{
  "value": {
    "recommendations": [
      {
        "movie": "Based on your taste profile from Twelve Angry Men, Dr Jekyll and Mr Hyde, and Rope",
        "books": [
          {
            "title": "Crime and Punishment",
            "author": "Fyodor Dostoevsky",
            "reason": "This novel delves deeply into the mind of Raskolnikov, a character who embodies the struggle with morality and the consequences of his actions, resonating with the themes of moral dilemmas and identity that the user appreciates. The psychological depth and intense exploration of guilt and redemption align perfectly with the user's taste for complex narratives and character development. The pacing is methodical, allowing for an exploration of existential themes, much like the tension found in 'Twelve Angry Men' and 'Rope.'",
            "rating": 4.238901869158878,
            "cover_url": "https://assets.hardcover.app/edition/9607814/495cb96fd40579474d87f8950c30e38380b6222a.jpeg",
            "hardcover_url": "https://hardcover.app/books/crime-and-punishment",
            "taste_match_score": 0.95,
            "primary_appeal": "Complex character exploration and moral dilemmas",
            "genre_tags": [
              "Classics",
              "Russian Literature",
              "Murder",
              "Crime",
              "Literature",
              "Fiction",
              "History",
              "Russian fiction",
              "General",
              "literary criticism"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1857,
            "page_count": 602,
            "publisher": null,
            "hardcover_id": "469783",
            "users_count": 2697,
            "description": "Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden sex worker, can offer the chance of redemption."
          },
          {
            "title": "The Strange Case of Dr Jekyll and Mr Hyde",
            "author": "Robert Louis Stevenson",
            "reason": "This novella directly relates to the user's interest in duality and identity as it presents a character split between his respectable persona and his darker impulses. The narrative structure is compact yet rich in psychological tension, echoing the storytelling style found in the user's film preferences. The exploration of the darker aspects of human nature and moral ambiguity aligns seamlessly with the user's thematic interests and emotional tone.",
            "rating": 3.735378031383738,
            "cover_url": "https://assets.hardcover.app/edition/27220250/7887036-L.jpg",
            "hardcover_url": "https://hardcover.app/books/strange-case-of-dr-jekyll-and-mr-hyde-1818",
            "taste_match_score": 0.9,
            "primary_appeal": "Identity and duality themes",
            "genre_tags": [
              "Horror",
              "Classics",
              "Fiction",
              "Science fiction",
              "Mystery",
              "Philosophy",
              "Young Adult",
              "Literature",
              "Comics",
              "Romance"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1818,
            "page_count": 141,
            "publisher": null,
            "hardcover_id": "346880",
            "users_count": 1464,
            "description": "Set in the backdrop later Victorian London, this book can be told as belonging to the category of science fiction, psychological thriller and suspense thriller. Dr Jekyll, a famous and notable scientist seems to be somehow linked with Mr Hyde, a most-wanted criminal. Mr Utterson, a good renown lawyer of the period as well as Jekyll's good friend, tries connecting the dots to find out the truth, a most-shocking truth."
          },
          {
            "title": "The Trial",
            "author": "Franz Kafka",
            "reason": "Kafka's exploration of justice and the absurdity of the human condition resonates with the themes of moral dilemmas and justice present in the user's chosen films. The narrative style is surreal and unsettling, allowing for a deep dive into the psychological turmoil of the protagonist. The emotional tone is heavy with existential dread, mirroring the serious introspection found in the films. The characters grapple with their fates in a world that feels both oppressive and incomprehensible, aligning with the user's preferences.",
            "rating": 3.897674418604651,
            "cover_url": "https://assets.hardcover.app/book_mappings/7333110/1bad0e0acb5bd7f0911b6b939154638d812469b4.jpeg",
            "hardcover_url": "https://hardcover.app/books/the-trial",
            "taste_match_score": 0.92,
            "primary_appeal": "Moral and existential exploration",
            "genre_tags": [
              "Science fiction",
              "Fantasy",
              "Fiction",
              "German fiction",
              "General",
              "Dystopian",
              "Literature",
              "Psychology",
              "Soviet Union",
              "Literature & Fiction"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1925,
            "page_count": 255,
            "publisher": null,
            "hardcover_id": "29886",
            "users_count": 1257,
            "description": "Byzantine and claustrophobic novel of a man arrested by the secret police and charged with an unspecified crime. Unable to defend himself and disorientated by the legal process at work around him the man soon becomes apathetic and acquiescent, accepting his eventual sentence as inevitable."
          },
          {
            "title": "The Metamorphosis",
            "author": "Franz Kafka",
            "reason": "Kafka's 'The Metamorphosis' offers a profound exploration of identity and alienation through the transformation of Gregor Samsa. This aligns with the user's interest in character complexity and psychological depth, as Gregor’s internal conflict and the reactions of those around him reflect moral dilemmas and human nature. The narrative's focus on the surreal and the absurd resonates with the atmospheric and visual elements appreciated by the user, creating an immersive reading experience that complements their cinematic tastes.",
            "rating": 3.814207650273224,
            "cover_url": "https://assets.hardcover.app/external_data/59991877/b720791bd9fa84ef7c087d4531f3bfa3580d3882.jpeg",
            "hardcover_url": "https://hardcover.app/books/the-metamorphosis",
            "taste_match_score": 0.88,
            "primary_appeal": "Exploration of identity and alienation",
            "genre_tags": [
              "Fiction",
              "Classics",
              "Young Adult",
              "European Literature -- Modern",
              "General",
              "Literature",
              "Compact discs",
              "Foreign Language Study",
              "Science fiction",
              "Fantasy"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1915,
            "page_count": 106,
            "publisher": null,
            "hardcover_id": "431713",
            "users_count": 2495,
            "description": "-- Presents the most important 20th-century criticism on major works from The Odyssey through modern literature-- The critical essays reflect a variety of schools of criticism-- Contains critical biographies, notes on the contributing critics, a chronology of the author's life, and an index Copyright © Libri GmbH. All rights reserved."
          },
          {
            "title": "Notes from Underground",
            "author": "Fyodor Dostoevsky",
            "reason": "This novel presents a protagonist who embodies the complexities of human psychology, showcasing the internal conflict and moral ambivalence that the user appreciates. The narrative is introspective and often confrontational, mirroring the dialogue-driven style of the user's chosen films. Dostoevsky’s focus on existential themes and the absurdities of society aligns well with the user's interest in deep psychological explorations and ethical quandaries, making it a compelling recommendation.",
            "rating": 4.059426229508197,
            "cover_url": "https://assets.hardcover.app/external_data/39781254/045ee2462f648779a57b82f3b9a592bc19f7b68a.jpeg",
            "hardcover_url": "https://hardcover.app/books/notes-from-underground-1847",
            "taste_match_score": 0.91,
            "primary_appeal": "Deep psychological exploration and moral conflict",
            "genre_tags": [
              "Classics",
              "Genre Fiction",
              "Fiction",
              "Philosophy",
              "General",
              "Literature",
              "History",
              "Propaganda",
              " Communist",
              "Juvenile Nonfiction"
            ],
            "complexity_level": null,
            "isbn": null,
            "publication_year": 1847,
            "page_count": 198,
            "publisher": null,
            "hardcover_id": "42",
            "users_count": 880,
            "description": "Notes from Underground (pre-reform Russian: Записки изъ подполья; post-reform Russian: Записки из подполья, tr. Zapíski iz podpólʹya), also translated as Notes from the Underground or Letters from the Underworld, is an 1864 novella by Fyodor Dostoevsky. Notes is considered by many to be one of the first existentialist novels. It presents itself as an excerpt from the rambling memoirs of a bitter, isolated, unnamed narrator (generally referred to by critics as the Underground Man), who is a retired civil servant living in St. Petersburg. The first part of the story is told in monologue form, or the underground man's diary, and attacks emerging Western philosophy, especially Nikolay Chernyshevsky's What Is to Be Done? The second part of the book is called \"Apropos of the Wet Snow\" and describes certain events that appear to be destroying and sometimes renewing the underground man, who acts as a first person, unreliable narrator and anti-hero."
          }
        ],
        "taste_profile": {
          "themes": [
            "moral dilemmas",
            "identity and duality",
            "justice and human nature"
          ],
          "narrative_style": "The user prefers tight, dialogue-driven narratives that rely on suspense and tension, often set in confined spaces, exploring complex moral questions.",
          "emotional_tone": "A serious and introspective emotional register, with a focus on existential themes and psychological depth.",
          "genre_fusion": "The user enjoys psychological thrillers and drama, particularly those that explore moral ambiguity and the darker sides of human nature.",
          "character_preferences": "Characters that are complex and flawed, often grappling with internal conflicts and ethical dilemmas, showcasing profound character development.",
          "artistic_sensibilities": "An appreciation for minimalist settings that enhance psychological tension, with a focus on character interaction and moral stakes.",
          "confidence_score": 0.85
        },
        "recommendation_type": "unified"
      }
    ],
    "insights": {
      "total_movies_analyzed": 3,
      "dominant_themes": [
        "moral dilemmas",
        "identity and duality",
        "justice and human nature"
      ],
      "genre_diversity_score": 1.0,
      "recommendation_confidence": 0.85,
      "alternative_suggestions": []
    },
    "processing_time": 13.003138303756714,
    "cache_hit": false
  },
  "created_at": "2025-07-20T02:02:06.643852",
  "expired_at": "2025-07-20T03:02:06.643832",
  "key": "movies_v2:3897f30d3c0a03022cc76a359d5447e4",
  "cache_type": "recommendations",
  "version": "2.0"
}