{
  "value": {
    "title": "The Dark Forest",
    "author": "Cixin Liu",
    "authors": [
      "Cixin Liu",
      "Joel Martinsen"
    ],
    "cover_url": "https://assets.hardcover.app/editions/30390608/6f1556b0-7613-4243-bc8f-078106dd20eb-ddark.jpg",
    "rating": 4.258928571428571,
    "rating_count": 784,
    "users_count": 1493,
    "url": "https://hardcover.app/books/the-dark-forest",
    "publication_year": 2008,
    "release_date": "2008-01-01",
    "page_count": 400,
    "description": "This near-future trilogy is the first chance for English-speaking listeners to experience this multiple-award-winning phenomenon from Cixin Liu, China's most beloved science fiction author.\n\nIn The Dark Forest, Earth is reeling from the revelation of a coming alien invasion - in just four centuries' time. The aliens' human collaborators may have been defeated, but the presence of the sophons, the subatomic particles that allow Trisolaris instant access to all human information, means that Earth's defense plans are totally exposed to the enemy. Only the human mind remains a secret. This is the motivation for the Wallfacer Project, a daring plan that grants four men enormous resources to design secret strategies, hidden through deceit and misdirection from Earth and Trisolaris alike.\n\nThree of the Wallfacers are influential statesmen and scientists, but the fourth is a total unknown. Luo Ji, an unambitious Chinese astronomer and sociologist, is baffled by his new status. All he knows is that he's the one Wallfacer that Trisolaris wants dead.",
    "genres": [
      "Science fiction",
      "Fiction",
      "General",
      "Space",
      "War",
      "Dystopian",
      "Aliens",
      "Fantasy",
      "History"
    ],
    "subtitle": null,
    "hardcover_id": "427838",
    "slug": "the-dark-forest"
  },
  "created_at": "2025-07-19T19:26:13.399425",
  "expired_at": "2025-07-20T19:26:13.399415",
  "key": "book_v2:e4d07d3fa37bb6c7b1d9ec42230ddec6",
  "cache_type": "books",
  "version": "2.0"
}