{
  "value": {
    "title": "Dark Matter",
    "author": "Blake Crouch",
    "authors": [
      "Blake Crouch"
    ],
    "cover_url": "https://assets.hardcover.app/book_mappings/7332342/e3c5928fc0a24ca97940c68f03dd2b503e42ba4f.jpeg",
    "rating": 4.03244005641749,
    "rating_count": 1418,
    "users_count": 3050,
    "url": "https://hardcover.app/books/dark-matter",
    "publication_year": 2016,
    "release_date": "2016-01-01",
    "page_count": 340,
    "description": "A mindbending, relentlessly surprising thriller from the author of the bestselling Wayward Pines trilogy. “Are you happy with your life?” Those are the last words Jason Dessen hears before the masked abductor knocks him unconscious. Before he awakens to find himself strapped to a gurney, surrounded by strangers in hazmat suits. Before a man Jason’s never met smiles down at him and says, “Welcome back, my friend.” In this world he’s woken up to, Jason’s life is not the one he knows. His wife is not his wife. His son was never born. And Jason is not an ordinary college physics professor, but a celebrated genius who has achieved something remarkable. Something impossible. Is it this world or the other that’s the dream? And even if the home he remembers is real, how can Jason possibly make it back to the family he loves? The answers lie in a journey more wondrous and horrifying than anything he could’ve imagined—one that will force him to confront the darkest parts of himself even as he battles a terrifying, seemingly unbeatable foe. Dark Matter is a brilliantly plotted tale that is at once sweeping and intimate, mind-bendingly strange and profoundly human—a relentlessly surprising science-fiction thriller about choices, paths not taken, and how far we’ll go to claim the lives we dream of.",
    "genres": [
      "Science fiction",
      "Fiction",
      "Kidnapping victims",
      "Mystery",
      "Suspense",
      "Fantasy",
      "Dystopian",
      "Time Travel",
      "Thriller",
      "Adventure"
    ],
    "subtitle": "A Novel",
    "hardcover_id": "57214",
    "slug": "dark-matter"
  },
  "created_at": "2025-07-19T19:25:30.954283",
  "expired_at": "2025-07-20T19:25:30.954271",
  "key": "book_v2:0e198c8b054a09cf27211fee6c30fdeb",
  "cache_type": "books",
  "version": "2.0"
}