{
  "value": {
    "title": "Annihilation",
    "author": "Jeff VanderMeer",
    "authors": [
      "Jeff VanderMeer"
    ],
    "cover_url": "https://assets.hardcover.app/external_data/61104538/b91d0115043c247a33f6cea3d9aa571ff85721df.jpeg",
    "rating": 3.718685831622177,
    "rating_count": 974,
    "users_count": 2095,
    "url": "https://hardcover.app/books/annihilation",
    "publication_year": 2014,
    "release_date": "2014-01-01",
    "page_count": 208,
    "description": "Area X has been cut off from the rest of the continent for decades. Nature has reclaimed the last vestiges of human civilization. The first expedition returned with reports of a pristine, Edenic landscape; the second expedition ended in mass suicide; the third expedition in a hail of gunfire as its members turned on one another. The members of the eleventh expedition returned as shadows of their former selves, and within weeks, all had died of cancer. In Annihilation, the first volume of Jeff VanderMeer's Southern Reach trilogy, we join the twelfth expedition.\n\nThe group is made up of four women: an anthropologist; a surveyor; a psychologist, the de facto leader; and our narrator, a biologist. Their mission is to map the terrain, record all observations of their surroundings and of one another, and, above all, avoid being contaminated by Area X itself.\n\nThey arrive expecting the unexpected, and Area X delivers—they discover a massive topographic anomaly and life forms that surpass understanding—but it's the surprises that came across the border with them and the secrets the expedition members are keeping from one another that change everything.",
    "genres": [
      "Science fiction",
      "Fiction",
      "Dystopian",
      "Suspense",
      "General",
      "Biologists",
      "Fantasy",
      "Fiction; Horror; Literary; Science Fiction",
      "Adventure",
      "Mystery"
    ],
    "subtitle": "A Novel: Movie Tie-In Edition",
    "hardcover_id": "192491",
    "slug": "annihilation"
  },
  "created_at": "2025-07-19T19:26:12.583094",
  "expired_at": "2025-07-20T19:26:12.583078",
  "key": "book_v2:4a80f675e7e525bc8664b9c8559563e0",
  "cache_type": "books",
  "version": "2.0"
}