{
  "value": {
    "title": "A Visit from the Goon Squad",
    "author": "Jennifer Egan",
    "authors": [
      "Jennifer Egan"
    ],
    "cover_url": "https://assets.hardcover.app/edition/30400488/be5fd0661f044488345da40a2c70a7e4aea41fe8.jpeg",
    "rating": 3.806338028169014,
    "rating_count": 284,
    "users_count": 650,
    "url": "https://hardcover.app/books/a-visit-from-the-goon-squad",
    "publication_year": 2010,
    "release_date": "2010-01-01",
    "page_count": 289,
    "description": "Jennifer Egan's spellbinding interlocking narratives circle the lives of Bennie Salazar, an aging former punk rocker and record executive, and Sasha, the passionate, troubled young woman he employs. Although Bennie and Sasha never discover each other's pasts, the reader does, in intimate detail, along with the secret lives of a host of other characters whose paths intersect with theirs, over many years, in locales as varied as New York, San Francisco, Naples, and Africa.\r\n\r\nWe first meet Sasha in her mid-thirties, on her therapist's couch in New York City, confronting her long-standing compulsion to steal. Later, we learn the genesis of her turmoil when we see her as the child of a violent marriage, then as a runaway living in Naples, then as a college student trying to avert the suicidal impulses of her best friend. We plunge into the hidden yearnings and disappointments of her uncle, an art historian stuck in a dead marriage, who travels to Naples to extract Sasha from the city's demimonde and experiences an epiphany of his own while staring at a sculpture of Orpheus and Eurydice in the Museo Nazionale. \r\n\r\nWe meet Bennie Salazar at the melancholy nadir of his adult life--divorced, struggling to connect with his nine-year-old son, listening to a washed-up band in the basement of a suburban house--and then revisit him in 1979, at the height of his youth, shy and tender, reveling in San Francisco's punk scene as he discovers his ardor for rock and roll and his gift for spotting talent. We learn what became of his high school gang--who thrived and who faltered--and we encounter Lou Kline, Bennie's catastrophically careless mentor, along with the lovers and children left behind in the wake of Lou's far-flung sexual conquests and meteoric rise and fall.\r\n\r\n*A Visit from the Goon Squad* is a book about the interplay of time and music, about survival, about the stirrings and transformations set inexorably in motion by even the most passing conjunction of our fates. In a breathtaking array of styles and tones ranging from tragedy to satire to PowerPoint, Egan captures the undertow of self-destruction that we all must either master or succumb to; the basic human hunger for redemption; and the universal tendency to reach for both--and escape the merciless progress of time--in the transporting realms of art and music. Sly, startling, exhilarating work from one of our boldest writers. *From the Hardcover edition.*",
    "genres": [
      "Fiction",
      "Literature",
      "Friendship",
      "Anthologies & Short Stories",
      "Literary Fiction",
      "Genre Fiction",
      "Psychological",
      "Anthologies"
    ],
    "subtitle": null,
    "hardcover_id": "10099",
    "slug": "a-visit-from-the-goon-squad"
  },
  "created_at": "2025-07-20T01:55:45.565904",
  "expired_at": "2025-07-21T01:55:45.565872",
  "key": "book_v2:67bddd1130172764d2714e00426b7257",
  "cache_type": "books",
  "version": "2.0"
}