{
  "value": {
    "title": "The Space Between Worlds",
    "author": "Micaiah Johnson",
    "authors": [
      "Micaiah Johnson"
    ],
    "cover_url": "https://assets.hardcover.app/edition/30402919/content.jpeg",
    "rating": 3.854166666666667,
    "rating_count": 192,
    "users_count": 674,
    "url": "https://hardcover.app/books/the-space-between-worlds",
    "publication_year": 2015,
    "release_date": "2015-07-20",
    "page_count": 336,
    "description": "Multiverse travel is finally possible, but there’s just one catch: No one can visit a world where their counterpart is still alive. Enter Cara, whose parallel selves happen to be exceptionally good at dying—from disease, turf wars, or vendettas they couldn’t outrun. Cara’s life has been cut short on 372 worlds in total.\n\nOn this dystopian Earth, however, Cara has survived. Identified as an outlier and therefore a perfect candidate for multiverse travel, Cara is plucked from the dirt of the wastelands. Now what once made her marginalized has finally become an unexpected source of power. She has a nice apartment on the lower levels of the wealthy and walled-off Wiley City. She works—and shamelessly flirts—with her enticing yet aloof handler, Dell, as the two women collect off-world data for the Eldridge Institute. She even occasionally leaves the city to visit her family in the wastes, though she struggles to feel at home in either place. So long as she can keep her head down and avoid trouble, Cara is on a sure path to citizenship and security.\n\nBut trouble finds Cara when one of her eight remaining doppelgängers dies under mysterious circumstances, plunging her into a new world with an old secret. What she discovers will connect her past and her future in ways she could have never imagined—and reveal her own role in a plot that endangers not just her world but the entire multiverse.",
    "genres": [
      "Science fiction",
      "Fiction",
      "Dystopian",
      "LGBTQ",
      "Fantasy",
      "Read 2024",
      "Young Adult",
      "Adventure"
    ],
    "subtitle": null,
    "hardcover_id": "431676",
    "slug": "the-space-between-worlds"
  },
  "created_at": "2025-07-19T22:24:52.033686",
  "expired_at": "2025-07-20T22:24:52.033660",
  "key": "book_v2:c2de92be8eda640720383b6cce72041b",
  "cache_type": "books",
  "version": "2.0"
}