{
  "value": {
    "title": "Blindsight",
    "author": "Peter Watts",
    "authors": [
      "Peter Watts"
    ],
    "cover_url": "https://assets.hardcover.app/book_mappings/7333230/0c3d4d7893e47e39bcbde68fcb6c343a2be66a24.jpeg",
    "rating": 3.821086261980831,
    "rating_count": 313,
    "users_count": 883,
    "url": "https://hardcover.app/books/blindsight",
    "publication_year": 2006,
    "release_date": "2006-10-03",
    "page_count": 384,
    "description": "*Two months since the stars fell...*\r\n\r\nTwo months since sixty-five thousand alien objects clenched around the Earth like a luminous fist, screaming to the heavens as the atmosphere burned them to ash. Two months since that moment of brief, bright surveillance by agents unknown. \r\n\r\nTwo months of silence while a world holds its breath. \r\n\r\nNow some half-derelict space probe, sparking fitfully past Neptune's orbit, hears a whisper from the edge of the solar system: a faint signal sweeping the cosmos like a lighthouse beam. Whatever's out there isn't talking to us. It's talking to some distant star, perhaps. Or perhaps to something closer, something *en route.* \r\n\r\nSo who do you send to force introductions on an intelligence with motives unknown, maybe unknowable? Who do you send to meet the alien when the alien doesn't want to meet? \r\n\r\nYou send a linguist with multiple personalities, her brain surgically partitioned into separate, sentient processing cores. You send a biologist so radically interfaced with machinery that he sees X-rays and tastes ultrasound, so compromised by grafts and splices that he no longer feels his own flesh. You send a pacifist warrior in the faint hope she won't be needed, and a fainter hope that she'll do any good if she is needed. You send a monster to command them all, an extinct hominid predator once called \"vampire,\" recalled from the grave with the voodoo of recombinant genetics and the blood of sociopaths. And you send a synthesist—an informational topologist with half his mind gone—as an interface between *here* and *there,* a conduit through which the Dead Center might hope to understand the Bleeding Edge. \r\n\r\nYou send them all to the edge of interstellar space, praying you can trust such freaks and retrofits with the fate of a world. You fear they may be more alien than the thing they've been sent to find. \r\n\r\nBut you'd give anything for that to be true, if you only knew what was waiting for them....",
    "genres": [
      "Science fiction",
      "Fiction",
      "Alien Contact; Fiction; Hard Science Fiction; Science Fiction",
      "Fantasy",
      "Space",
      "Aliens",
      "Adventure"
    ],
    "subtitle": null,
    "hardcover_id": "384771",
    "slug": "blindsight"
  },
  "created_at": "2025-07-19T20:55:36.673433",
  "expired_at": "2025-07-20T20:55:36.673418",
  "key": "book_v2:eb6f5ad3d43307eef888adb8b2ab6a37",
  "cache_type": "books",
  "version": "2.0"
}